# 서문

> 자바스크립트의 탄생 목적은 애플리케이션 개발이 아닌 웹페이지의 단순 보조 기능
> 

### 기본 개념과 동작 원리 이해의 중요성

1. 기본 개념 : 문맥에 받는 정확한 용어 구사

⇒ 명확한 의사소통(협업의 기본, 필수요소)

다른 프레임워크 및 언어 학습에도 도움이 됨

1. 동작 원리의 이해 : 코드 동작 예측과 코드 독해의 원천

<aside>
💡

기본기는 아무리 강조해도 지나치치 않다

</aside>

### 학습 순서

1. 기본 개념과 동작 원리 이해 노력 (중요 키워드 중심)
    
    완벽한 이해 필요 x 여러번 반복 학습 (기술 부채를 두려워하지 않기)
    
2. 코드 구현 능력을 위한 의도적 연습
    
    지속적으로 자신의 능력을 살짝 넘어서는 도전
    
    무엇을 모르는지, 모르는 걸 알기위한 시도와 실패
    
3. 프로젝트 경험
    
    깊은 이해와 협업 경험
    
    추가 필요 학습 사항 파악
    

1~3을 순환적으로 반복하며 지속적 개선을 통한 성장

# 1장

## 1. 1 프로그래밍이란?

컴퓨터에게 실행을 요구하는 커뮤니케이션

요구사항을 명확히 이해한 후 해결 방안 정의

- 문제 해결 능력
    
    요구사항 이해 / 복잡함을 분해 / 자료 정리 구분 / 순서에 맞게 행위 배열
    

⇒ 정확하고 상세하게 요구사항 설명

- 컴퓨터와 사람은 사고, 인지의 방식이 다르므로 인간이 아닌 컴퓨터의 관점에서 사고해야 한다

## 1. 2 프로그래밍 언어

- 컴파일러 / 인터프리터 : 일종의 번역기

프로그래밍 : 구문 + 의미

## 1. 3 구문과 의미

<aside>
💡

프로그래밍의 목적은 문제 해결이다

</aside>

문제 해결 능력은 문법 / 의미에 부합한 코드로 변환되어야 한다

```jsx
요구사항의 집합을 분석해서 적절한 자료구조와 함수의 집합으로 변환한 후 흐름을 제어하는 것
```
