# 1장 프로그래밍

## 1.1 프로그래밍이란?

### 프로그래밍 = 컴퓨와 사람 간의 커뮤니케이션

- 요구사항을 컴퓨터가 이해하기 쉽도록 단순하게 분해, 정리, 구분, 배열해야 함

### 컴퓨팅 사고 = 컴퓨터의 입장에서 문제를 바라보는 것

- 사람에겐 당연한 것이 컴퓨터에겐 당연하지 않음
- 컴퓨터의 관점에서 문제를 인지하고 사고해야 프로그래밍이 가능

## 1.2 프로그래밍 언어

- 문제 해결 방안(프로그램)은 컴퓨터에게 전달됨
- 컴퓨터는 사람이 쓰는 언어인 자연어가 아니라 기계어만 이해할 수 있음
- 그래서 컴퓨터가 번역할 수 있는 언어인 프로그래밍 언어로 프로그램을 작성 후 기계어로 번역하여 실행하게 됨
- 결국 프로그래밍 언어는 마치 언어처럼 구문과 의미의 조합으로 표현됨

## 1.3 구문과 의미

- 프로그래밍 언어도 언어이기에 문법을 배워야 사용할 수 있음
- 하지만 문법과 더불어 의미도 갖추어야 올바른 코드로 동작할 수 있음
- 결국 문제를 해결하기 위해서는 적절한 문법을 사용해 의미를 갖춘 프로그램을 만들 수 있어야 함

# MBTI 테스트 프로그램

## 문제

### MBTI 검사의 원리

- MBTI 검사를 위한 문제가 주어지고, 취향껏 답변을 선택하게 되면 최종적으로 나의 MBTI가 결정됨

### MBTI 테스트 프로그램에 필요한 로직?

- 문제의 답을 선택할 때 마다 특정 MBTI에 가중치가 부여됨
- 모든 답변을 선택하면 지금까지 부여된 가중치를 계산하여 나의 MBTI를 결정

### 필요한 것들

- 버튼과 문제, 결과를 보여줄 화면들
- 문제와 결과 정보를 담을 변수
- MBTI 점수를 담을 변수
- 버튼을 눌렀을때 가중치를 부여할 함수
- MBTI 점수를 계산할 함수
- 특정 MBTI 결과에 맞는 데이터를 보여주는 함수
